In [25]:
import pandas as pd
import numpy as np

### Construct a DataFrame in Pandas using string data

In [2]:
df = pd.DataFrame({
    "Name" : ["Ramesh", "SuResh", "SunNIL", "GauTaM"],
    "Designation" : ["Ds", "DevOps", "PyTHon DeveLOPer", "PrOGramer"],
    "Age" : [20,21,23,25],
    "Company" : ["TCS", "PhiLIps", "Diolite", "Amazon"]
})

In [3]:
df

     Name       Designation  Age  Company
0  Ramesh                Ds   20      TCS
1  SuResh            DevOps   21  PhiLIps
2  SunNIL  PyTHon DeveLOPer   23  Diolite
3  GauTaM         PrOGramer   25   Amazon

### Clean the string data in the given Pandas Dataframe

In [22]:
df.drop(columns="Age",inplace=True)

In [23]:
df

     Name       Designation  Company
0  Ramesh                Ds      TCS
1  SuResh            DevOps  PhiLIps
2  SunNIL  PyTHon DeveLOPer  Diolite
3  GauTaM         PrOGramer   Amazon

In [24]:
for i in df.index:
    df.iloc[i] = df.iloc[i].apply(lambda x: x.title())
df

     Name       Designation  Company
0  Ramesh                Ds      Tcs
1  Suresh            Devops  Philips
2  Sunnil  Python Developer  Diolite
3  Gautam         Programer   Amazon

### Reindexing in Pandas DataFrame

In [34]:
column = ['A', 'B', 'C', 'D', 'E']
index = ['a', 'b', 'c', 'd', 'e']

data = pd.DataFrame(np.random.randint(1,20,size=[5,5]), index=index, columns=column)

In [35]:
data

    A   B   C   D   E
a  14   6   8  10   5
b  12   3  11  16   6
c   6  12  16  18  14
d  11   2  10  18  10
e   1   8   1  14  14

In [40]:
data.reindex(['e', 'd', 'c', 'a', 'b'])

    A   B   C   D   E
e   1   8   1  14  14
d  11   2  10  18  10
c   6  12  16  18  14
a  14   6   8  10   5
b  12   3  11  16   6

In [38]:
column=['a','b','c','d','e']
index=['A','B','C','D','E']
 
# create a dataframe of random values of array
df1 = pd.DataFrame(np.random.rand(5,5),
            columns=column, index=index)
 
print(df1)
 
print('\n\nDataframe after reindexing rows: \n',
df1.reindex(['B', 'D', 'A', 'C', 'E']))

          a         b         c         d         e
A  0.868139  0.400044  0.891450  0.354562  0.001998
B  0.199411  0.620739  0.912932  0.566813  0.775481
C  0.929507  0.607953  0.480360  0.022422  0.657381
D  0.046882  0.268811  0.559771  0.883980  0.761649
E  0.144951  0.561450  0.085040  0.287443  0.860643


Dataframe after reindexing rows:
           a         b         c         d         e
B  0.199411  0.620739  0.912932  0.566813  0.775481
D  0.046882  0.268811  0.559771  0.883980  0.761649
A  0.868139  0.400044  0.891450  0.354562  0.001998
C  0.929507  0.607953  0.480360  0.022422  0.657381
E  0.144951  0.561450  0.085040  0.287443  0.860643

### How to iterate over rows in Pandas Dataframe

In [41]:
data

    A   B   C   D   E
a  14   6   8  10   5
b  12   3  11  16   6
c   6  12  16  18  14
d  11   2  10  18  10
e   1   8   1  14  14

In [46]:
for i,r in data.iterrows():
    print(i,r)

a A    14
B     6
C     8
D    10
E     5
Name: a, dtype: int32
b A    12
B     3
C    11
D    16
E     6
Name: b, dtype: int32
c A     6
B    12
C    16
D    18
E    14
Name: c, dtype: int32
d A    11
B     2
C    10
D    18
E    10
Name: d, dtype: int32
e A     1
B     8
C     1
D    14
E    14
Name: e, dtype: int32